#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/aws_deepdive/kubernetes-ops-staging-helm-ingress-nginx/runs/run-JJER8vuvAov95RZe

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
data.template_file.helm_values: Reading...
data.template_file.helm_values: Read complete after 0s [id=e3b0c44298fc1c149afbf4c8996fb92427ae41e4649b934ca495991b7852b855]
data.terraform_remote_state.eks: Read complete after 0s
module.ingress-nginx-external.helm_release.helm_chart: Refreshing state... [id=ingress-nginx]
data.aws_eks_cluster_auth.main: Reading...
data.aws_eks_cluster_auth.main: Read complete after 0s [id=staging]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ingress-nginx-external.helm_release.helm_chart has been deleted
  - resource "helm_release" "helm_chart" {
      - chart                      = "ingress-nginx" -> null
        id                         = "ingress-nginx"
        name                       = "ingress-nginx"
      - status                     = "deployed" -> null
        # (25 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ingress-nginx-external.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "ingress-nginx"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + "",
        ]
      + verify                     = false
      + version                    = "4.7.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```


</details>

*Pusher: @anhtuanit93, Action: `pull_request`*